Server_Side_Scripting/ruby/Program_2/app/controllers/book_details_controller.rb

SELECT "book_details".* FROM "book_details"
---
  def index
    @book_details = BookDetail.all

INSERT INTO "book_details" ("Book_Name", "Author", "Price", "Mail_ID", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["Book_Name", "me"], ["Author", "vasanth"], ["Price", 12300.0], ["Mail_ID", "me_book@vasanth.com"], ["created_at", "2024-04-07 14:08:23.222148"], ["updated_at", "2024-04-07 14:08:23.222148"]]
---
  def create
    @book_detail = BookDetail.new(book_detail_params)

    respond_to do |format|
      if @book_detail.save

SELECT "book_details".* FROM "book_details" WHERE "book_details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_book_detail
      @book_detail = BookDetail.find(params[:id])